{"id":10558,"date":"2023-06-12T12:11:05","date_gmt":"2023-06-12T12:11:05","guid":{"rendered":"https:\/\/6valley.app\/?page_id=10558"},"modified":"2025-06-25T03:32:34","modified_gmt":"2025-06-25T03:32:34","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/6valley.app\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"10558\" class=\"elementor elementor-10558\">\n\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-378c6df elementor-section-full_width elementor-section-height-default elementor-section-height-default\" data-id=\"378c6df\" data-element_type=\"section\" data-settings=\"{&quot;background_background&quot;:&quot;classic&quot;}\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-9a6c88e\" data-id=\"9a6c88e\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t<section class=\"elementor-section elementor-inner-section elementor-element elementor-element-84e8b65 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"84e8b65\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-inner-column elementor-element elementor-element-e88685e\" data-id=\"e88685e\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-5e0cc86 sv_heading_one elementor-widget elementor-widget-sixam-advanced-text\" data-id=\"5e0cc86\" data-element_type=\"widget\" data-widget_type=\"sixam-advanced-text.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\r\n        <div class=\"advanced-text-wrapper\">\r\n            <div class=\"advanced_text\" id=\"sa_advanced_text\">\r\n                <h1>                                <span class=\"prefix-text h1  \">\r\n                    6Valley <b>Privacy Policy<\/b>                <\/span>\r\n                <span class=\"highlight-text h1 \">\r\n                                    <\/span>\r\n                <span class=\"suffix-text h1 \">\r\n                                    <\/span>\r\n                <\/a>                <\/h1>            <\/div>\r\n        <\/div>\r\n\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-743c5726 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"743c5726\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-508c69fe\" data-id=\"508c69fe\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-2ca222ef elementor-widget elementor-widget-text-editor\" data-id=\"2ca222ef\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t\t\n<p><strong>Update: July 2023<\/strong><\/p>\n\n<h2 class=\"wp-block-heading\">Introduction<\/h2>\n\n<p>Welcome to 6Valley.<\/p>\n\n<p>6Valley (“us,” “we,” or “our”) operates at https:\/\/6valley.app (hereinafter referred to as “Service”).<\/p>\n\n<p>Our Privacy Policy regulates your visit to 6valley.app and describes how we collect, safeguard, and disclose data resulting from your use of our Service.<\/p>\n\n<p>We use your information to introduce and improve our services. You agree to collect and use information in line with this policy by using the Service. <\/p>\n\n<p>Our Terms and Conditions (“Terms”) govern all use of our Service and, together with the Privacy Policy, constitute your agreement with us (“Agreement”).<\/p>\n\n<h2 class=\"wp-block-heading\">Definitions<\/h2>\n\n<p><strong>SERVICE <\/strong>refers to 6Valley&#8217;s website, 6valley.app.<\/p>\n\n<p><strong>PERSONAL DATA<\/strong> refers to information on a live person who can be identified from that information (or from that information and other information in our possession or likely to come into our custody).<\/p>\n\n<p><strong>USAGE DATA<\/strong> is data that is automatically acquired, either through the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).<\/p>\n\n<p><strong>COOKIES<\/strong> are little files that are kept on your computer or mobile device.<\/p>\n\n<p><strong>A DATA CONTROLLER<\/strong> is a natural or legal person who determines the purposes for which and how personal data are or will be processed (alone, jointly, or in concert with other individuals). We are the Data Controller of your data for the purposes of this Privacy Policy.<\/p>\n\n<p>Any natural or legal person that processes data on behalf of the Data Controller is called a <strong>DATA PROCESSOR<\/strong> (OR SERVICE PROVIDER). To process your data more efficiently, we may employ the services of numerous Service Providers.<\/p>\n\n<p>Any living individual who is the subject of Personal Data is referred to as a <strong>DATA SUBJECT<\/strong>.<\/p>\n\n<p><strong>THE USER<\/strong> is the person who uses our Service. The Data Subject, the subject of Personal Data, corresponds to the User.<\/p>\n\n<p><strong>Information Gathering and Application<\/strong><\/p>\n\n<p>We collect various sorts of information for various purposes in order to deliver and improve our Service.<\/p>\n\n<h2 class=\"wp-block-heading\"><strong>Types of Data Collected<\/strong><\/h2>\n\n<h3 class=\"wp-block-heading\"><strong>Personal Data<\/strong><\/h3>\n\n<p>We may ask you to provide us with personally identifying information that can be used to contact or identify you while using our Service (&#8220;Personal Data&#8221;). Personally identifiable information may include, but is not limited to, the following:<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.1. <\/strong>Email address<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.2. <\/strong>First name and last name<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.3.<\/strong> Phone number<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.4. <\/strong>Address, Country, State, Province, ZIP\/Postal code, City<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.5. <\/strong>Cookies and Usage Data<\/p>\n\n<p>We may contact you with newsletters, marketing or promotional materials, and other information that may interest you. By clicking the unsubscribe link, you can opt out of receiving any or all of these emails from us.<\/p>\n\n<h3 class=\"wp-block-heading\"><strong>Usage Data<\/strong><\/h3>\n\n<p>We may also collect information your browser sends whenever you visit our Service or access it via any device (&#8220;Usage Data&#8221;).<\/p>\n\n<p>Usage Data may include your computer&#8217;s Internet Protocol address (e.g., IP address), browser type, browser version, the pages of our Service that you view, the time and date of your visit, the time spent on those pages, unique device identifiers, and other diagnostic data.<\/p>\n\n<p>When you use a device to access the Service, this Usage Data may contain information such as the type of device you are using, your device&#8217;s unique ID, your device&#8217;s IP address, your device&#8217;s operating system, the type of Internet browser you are using, unique device identifiers, and other diagnostic data.<\/p>\n\n<h3 class=\"wp-block-heading\"><strong>Location Data<\/strong><\/h3>\n\n<p>If you permit us, we may collect and store information about your location (&#8220;Location Data&#8221;). We use this data to deliver our Service&#8217;s features and develop and customize it.<\/p>\n\n<p>When using our Service, you can enable or prevent location services at any moment using your device settings.<\/p>\n\n<h3 class=\"wp-block-heading\"><strong>Tracking Cookies Data<\/strong><\/h3>\n\n<p>We use cookies and other tracking technologies to monitor and record activities on our Service.<\/p>\n\n<p>Cookies are little data files that may contain a unique anonymous identifier. Cookies are little text files transmitted to your browser from a website and kept on your device. Other tracking technologies, including beacons, tags, and scripts, are also used to collect and track information and develop and analyze our Service.<\/p>\n\n<p>You can tell your browser to reject all cookies or to notify you when one is received. However, if you refuse to accept cookies, you may be unable to utilize certain features of our Service.<\/p>\n\n<h3 class=\"wp-block-heading\">Examples of Cookies we use:<\/h3>\n\n<p style=\"padding-left: 40px;\"><strong>1. Session Cookies: <\/strong>Session Cookies are used to operate our Service.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>2. Preference Cookies: <\/strong>Preference Cookies are used by us to remember your choices and settings.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>3. Security Cookies: <\/strong>Security Cookies are used for security considerations.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>4. Advertising Cookies: <\/strong>Advertising Cookies are used to display advertising that is relevant to you and your interests.<\/p>\n\n<h3 class=\"wp-block-heading\"><strong>Other Data<\/strong><\/h3>\n\n<p>We may collect the following information while using our Service: sex, age, date of birth, place of birth, passport details, citizenship, registration at the place of residence and actual address, telephone number (work, mobile), details of documents on education, qualification, professional training, employment agreements, information on bonuses and compensation, information on marital status, family members, social security (or other taxpayer identification) number, etc.<\/p>\n\n<h4 class=\"wp-block-heading\"><strong>Use of Data<\/strong><\/h4>\n\n<p><strong>6Valley uses the collected data for various purposes:<\/strong><\/p>\n\n<p style=\"padding-left: 40px;\">1. to deliver and keep our Service running;<\/p>\n\n<p style=\"padding-left: 40px;\">2. to keep you informed of changes to our Service;<\/p>\n\n<p style=\"padding-left: 40px;\">3. to enable you to participate in interactive parts of our Service if you so desire;<\/p>\n\n<p style=\"padding-left: 40px;\">4. to offer client Service;<\/p>\n\n<p style=\"padding-left: 40px;\">5. to collect analysis or important information in order to improve our Service;<\/p>\n\n<p style=\"padding-left: 40px;\">6. to track how our Service is being used;<\/p>\n\n<p style=\"padding-left: 40px;\">7. to identify, avoid, and resolve technical difficulties<\/p>\n\n<p style=\"padding-left: 40px;\">8. to serve any other purpose for which you have provided it;<\/p>\n\n<p style=\"padding-left: 40px;\">9. to fulfill out our responsibilities and enforce our rights under any contracts we sign with you, including billing and collection;<\/p>\n\n<p style=\"padding-left: 40px;\">10. to send you notices concerning your account and\/or subscription, such as expiration and renewal notices, email instructions, and so on;<\/p>\n\n<p style=\"padding-left: 40px;\">11. to send you news, special offers, and general information about other items, services, and events comparable to those you have already purchased or enquired about, unless you have decided not to receive such information;<\/p>\n\n<p style=\"padding-left: 40px;\">12. in any other manner that we may specify when you give the information;<\/p>\n\n<p style=\"padding-left: 40px;\">13. for any other reason with your permission.<\/p>\n\n<h2 class=\"wp-block-heading\"><strong>Retention of Data<\/strong><\/h2>\n\n<p>We will only keep your Personal Data for as long as it is required for the reasons outlined in this Privacy Policy. We will retain and use your Personal Data to the extent necessary to comply with our legal duties (for example, if we are obliged by relevant laws to retain your data), resolve disputes, and enforce our legal agreements and policies.<\/p>\n\n<p>We will also save Usage Data for internal analysis. Usage Data is normally maintained for a shorter period of time, unless it is utilized to increase the security or operation of our Service, or we are legally required to retain this data for a longer period of time.<\/p>\n\n<h2 class=\"wp-block-heading\"><strong>Transfer of Data<\/strong><\/h2>\n\n<p>Your information, including Personal Data, may be transferred to and stored on computers outside your state, province, nation, or other governmental jurisdiction where data protection regulations differ from those in your jurisdiction.<\/p>\n\n<p>If you are located outside of the United States and choose to give us information, please be aware that we transmit the data, including Personal Data, to the United States and process it there.<\/p>\n\n<p>Your permission to that transfer is represented by your approval of this Privacy Policy and submission of such information.<\/p>\n\n<p>6Valley will take all reasonable steps to ensure that your data is treated securely and in accordance with this Privacy Policy, and no transfer of your Personal Data to an organization or country will take place unless adequate controls, including the security of your data and other personal information, are in place.<\/p>\n\n<h2 class=\"wp-block-heading\"><strong>Disclosure of Data<\/strong><\/h2>\n\n<h3 class=\"wp-block-heading\"><strong>We may disclose the following personal information that we collect or that you provide:<\/strong><\/h3>\n\n<p style=\"padding-left: 40px;\"><strong>1. Law Enforcement Disclosure<\/strong><\/p>\n\n<p style=\"padding-left: 40px;\">We may be forced to share your Personal Data in some circumstances, such as where required by law or in response to valid demands from public authorities.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>2. Commercial Transaction<\/strong><\/p>\n\n<p style=\"padding-left: 40px;\">Your Personal Data may be transferred if we or our subsidiaries are involved in a merger, acquisition, or asset sale.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>3. Other instances: <\/strong><\/p>\n\n<p style=\"padding-left: 40px;\">We may also disclose your information to the following third parties: <\/p>\n\n<p style=\"padding-left: 40px;\"><strong>3.1.<\/strong> to our subsidiaries and affiliates; <\/p>\n\n<p style=\"padding-left: 40px;\"><strong>3.2. <\/strong>to contractors, service providers, and other third parties who help us run our company.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>3.3. <\/strong>to serve the purpose for which it was provided;<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>3.4. <\/strong>in order to include your company&#8217;s logo on our website;<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>3.5. <\/strong>for any other reason stated by us when you provide the information; <\/p>\n\n<p style=\"padding-left: 40px;\"><strong>3.6. <\/strong>with your consent in all other situations; <\/p>\n\n<p style=\"padding-left: 40px;\"><strong>3.7. <\/strong>if we believe disclosure is necessary or appropriate to protect the Company&#8217;s, our customers, or others&#8217; rights, property, or safety.<\/p>\n\n<h2 class=\"wp-block-heading\"><strong>Security of Data<\/strong><\/h2>\n\n<p>We care about the security of your data but keep in mind that no form of Internet transmission or electronic storage is completely safe. While we endeavour to protect your Personal Data using commercially acceptable techniques, we cannot guarantee its ultimate security.<\/p>\n\n<p>Your Data Privacy Rights According to the General Data Protection Regulation (GDPR),<\/p>\n\n<p>GDPR protects some data privacy rights for residents of the European Union (EU) and the European Economic Area (EEA).<\/p>\n\n<p>We intend to take reasonable steps to allow you to correct, modify, delete, or limit the use of your Personal Data.<\/p>\n\n<p>If you wish to be informed what Personal Data we hold about you and if you want it to be removed from our systems, please email us at support@brandsolutions.icu.<\/p>\n\n<h3 class=\"wp-block-heading\">You have the following data protection rights in certain circumstances:<\/h3>\n\n<p style=\"padding-left: 40px;\"><strong>1. <\/strong>The ability to view, edit, or delete the information we have on file for you;<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>2. <\/strong>The right to be corrected. You have the right to have your information corrected if it is incorrect or incomplete.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>3. <\/strong>The option to object. You have the right to object to the processing of your personal information by us.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>4. <\/strong>The restriction right. You have the right to request that we limit our use of your personal information.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>5. <\/strong>Data portability is a legal right. You have the right to have a copy of your Personal Data delivered to you in a structured, machine-readable, and frequently used format.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>6. <\/strong>The ability to revoke permission. You may also withdraw your consent at any moment when we rely on it to process your personal information.<\/p>\n\n<p><strong>Please keep in mind that <\/strong>we may request that you prove your identity before responding to such requests. Please keep in mind that we may be unable to deliver Service if some required data is not provided.<\/p>\n\n<p>You have the right to lodge a complaint with a Data Protection Authority over the collection and use of your Personal Data by us. For additional information, please contact your European Economic Area (EEA) data protection authority.<\/p>\n\n<p>Your California Privacy Protection Act (CalOPPA) Data Protection Rights<\/p>\n\n<p>CalOPPA is the nation&#8217;s first state law requiring commercial websites and online services to disclose a privacy policy. The law&#8217;s reach extends far beyond California, requiring any person or company in the United States (and possibly the world) that operates websites collecting personally identifiable information from California consumers to post a prominent privacy policy on its website stating exactly what information is being collected and with whom it is being shared, as well as to comply with this policy.<\/p>\n\n<h2 class=\"wp-block-heading\"><strong>According to CalOPPA, we agree to the following:<\/strong><\/h2>\n\n<p style=\"padding-left: 40px;\">1. Users can access our website anonymously;<\/p>\n\n<p style=\"padding-left: 40px;\">2. Our Privacy Policy link includes the word &#8220;Privacy&#8221; and is clearly accessed on our website&#8217;s homepage;<\/p>\n\n<p style=\"padding-left: 40px;\">3. Users will be notified of any changes to our privacy policies via our Privacy Policy Page.<\/p>\n\n<p style=\"padding-left: 40px;\">4. Users can update their personal information by contacting us via email at support@brandsolutions.icu.<\/p>\n\n<h2 class=\"wp-block-heading\"><strong>Our Policy on “Do Not Track” Signals:<\/strong><\/h2>\n\n<p>When a Do Not Track browser feature is in place, we honor Do Not Track signals and do not track, plant cookies, or employ advertising. Do Not Track is a web browser preference that lets websites know you don&#8217;t want to be monitored.<\/p>\n\n<p>Do Not Track can be enabled or disabled by going to your web browser&#8217;s Preferences or Settings page.<\/p>\n\n<p>Your California Consumer Privacy Act (CCPA) Data Protection Rights<\/p>\n\n<p>If you live in California, you can understand what information we gather about you, request that it be deleted, and request that it not be sold (or shared). <\/p>\n\n<h4 class=\"wp-block-heading\"><strong>To exercise your data protection rights, you can make certain requests and ask us:<\/strong><\/h4>\n\n<p>What personal information do we have on file for you? <\/p>\n\n<h4 class=\"wp-block-heading\"><strong>If you make this request, we will respond as follows:<\/strong><\/h4>\n\n<p style=\"padding-left: 40px;\"><strong>0.0.1 <\/strong>The kind of personal information we have on file for you.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.0.2.<\/strong> The sources from which we obtain your personal information.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.0.3. <\/strong>The commercial or corporate reason for collecting or selling your personal information.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.0.4 <\/strong>Third-party categories with whom we exchange personal information.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.0.5 <\/strong>The exact pieces of personal information about you that we have gathered.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.0.6. <\/strong>A list of the categories of personal information that we have sold, as well as the category of any other firm to which we have sold it. We will notify you if we have not sold your personal information.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.0.7. <\/strong>A list of the categories of personal information that we have revealed for business purposes, as well as the category of any other firm with which we have shared it.<\/p>\n\n<p style=\"padding-left: 40px;\">Please keep in mind that you have the right to request this information from us up to two times in a calendar year. When you submit this request, the information you receive may be restricted to the personal information we acquired about you in the past 12 months.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.2. <\/strong>To get rid of your personal information. If you make this request, we will delete the personal information we have on file for you as of the date of your request and instruct any service providers to do the same. In some circumstances, deletion can be performed by de-identifying the data. If you delete your personal information, you may lose access to certain functions that rely on personal information to function.<\/p>\n\n<p style=\"padding-left: 40px;\"><strong>0.3. <\/strong>To refrain from selling your personal information. We will never sell or rent your personal information to a third party for any reason. We never sell your personal information for monetary gain. However, under certain conditions, a non-monetary transfer of personal information to a third party or within our family of organizations may be regarded as a &#8220;sale&#8221; under California law. You are the sole owner of your Personal Data and have the right to seek disclosure or deletion at any time.<\/p>\n\n<p>Please keep in mind that requesting that we delete or stop selling your data may impact your experience with us, and you may be unable to participate in certain programs or membership services that need your personal information to function. However, we would never discriminate against you for exercising your rights.<\/p>\n\n<p>To exercise your California data protection rights, please send your request(s) to support@brandsolutions.icu.<\/p>\n\n<p>As explained above, the California Consumer Privacy Act (CCPA) protects your data protection rights. To learn more, go to the California Legislative Information page. The CCPA went into force on January 1, 2020.<\/p>\n\n<h2 class=\"wp-block-heading\"><strong>Service Providers<\/strong><\/h2>\n\n<p>Third-party companies and persons (&#8220;Service Providers&#8221;) may be hired to enable our Service, offer Service on our behalf, conduct Service-related services, or assist us in assessing how our Service is utilized.<\/p>\n\n<p>These third parties have access to your Personal Data only to carry out these duties on our behalf and are not permitted to disclose or use it for any other reason.<\/p>\n\n<h3 class=\"wp-block-heading\">Analytics<\/h3>\n\n<p>We may employ third-party Service Providers to monitor and evaluate how our Service is used.<\/p>\n\n<h3 class=\"wp-block-heading\">CI\/CD software<\/h3>\n\n<p>We may engage third-party Service Providers to automate our Service&#8217;s development process.<\/p>\n\n<h3 class=\"wp-block-heading\">Advertising<\/h3>\n\n<p>To fund and operate our Service, we may utilize third-party Service Providers to display advertisements to you.<\/p>\n\n<h3 class=\"wp-block-heading\">Remarketing Based on Behavior<\/h3>\n\n<p>After you use our Service, we may utilize remarketing services to advertise to you on third-party websites. We and our third-party suppliers use cookies to inform, optimize, and deliver advertising based on your previous visits to our Service.<\/p>\n\n<h3 class=\"wp-block-heading\">Payments<\/h3>\n\n<p>Within the Service, we may offer paid products and\/or services. In that situation, we use third-party payment processing services (such as payment processors).<\/p>\n\n<p>We will not store or collect your credit card information. That information is transmitted directly to our third-party payment processors, whose Privacy Policies control their use of your personal information. These payment processors follow the PCI-DSS standards governed by the PCI Security Standards Council, a collaboration of brands such as Visa, Mastercard, American Express, and Discover. PCI-DSS rules contribute to the safe processing of payment information.<\/p>\n\n<h3 class=\"wp-block-heading\">Links to Other Sites<\/h3>\n\n<p>Our Service may contain links to websites not owned or controlled by us. When you click on a third-party link, you will be taken to the third-party&#8217;s website. We strongly suggest you read the privacy policies of each website.<\/p>\n\n<p>We have no control over and accept no responsibility for any third-party sites or services&#8217; content, privacy policies, or practices.<\/p>\n\n<h2 class=\"wp-block-heading\"><strong>Children’s Privacy<\/strong><\/h2>\n\n<p>Our Services are not for children under the age of 18 (&#8220;Child&#8221; or &#8220;Children&#8221;).<\/p>\n\n<p>We never gather personally-identifying information from children under the age of 18. Please notify us if you suspect a Child has given us Personal Data. If we discover that we have obtained Personal Data from Children without a parental agreement, we take steps to erase the data from our servers.<\/p>\n\n<h2 class=\"wp-block-heading\"><strong>Changes to This Privacy Policy<\/strong><\/h2>\n\n<p>We reserve the right to change our Privacy Policy at any moment. Any changes will be communicated to you by posting the revised Privacy Policy on this page.<\/p>\n\n<p>Prior to the modification becoming effective, we will notify you through email and\/or a conspicuous notice on our Service, and we will revise the &#8220;effective date&#8221; at the top of this Privacy Policy.<\/p>\n\n<h2 class=\"wp-block-heading\"><strong>GDPR Compliance<\/strong><\/h2>\n<p>If you are located in the <strong>EU<\/strong>, <strong>UK<\/strong>, or <strong>Switzerland<\/strong>, we process your personal data in line with the <strong>General Data Protection Regulation (GDPR)<\/strong>.<\/p>\n<p><strong>Our legal bases<\/strong> for processing include:<\/p>\n<ul>\n<li>Fulfilling contracts (e.g., delivering software),<\/li>\n<li>Our legitimate business interests,<\/li>\n<li>Legal obligations, and<\/li>\n<li>Your consent (e.g., for marketing or cookies).<\/li>\n<\/ul>\n<p>You have the right to:<\/p>\n<ul>\n<li>Access, correct, or delete your data<\/li>\n<li>Object to or restrict processing<\/li>\n<li>Request data portability<\/li>\n<li>Withdraw consent at any time<\/li>\n<\/ul>\n<p>To exercise your rights, email us at <strong><a class=\"theme\" href=\"mailto:support@brandsolutions.icu\" target=\"_blank\" rel=\"noopener noreferrer\">support@brandsolutions.icu<\/a><\/strong>.<\/p>\n<p>We may transfer your data outside the EU using approved safeguards (e.g., Standard Contractual Clauses). We also work with trusted third-party providers who comply with data protection laws.<\/p>\n<h2 class=\"wp-block-heading\"><strong>Contact Us<\/strong><\/h2>\n\n<p>If you have any questions about this Privacy Policy, please contact us by email: support@brandsolutions.icu<\/p>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>6Valley Privacy Policy Update: July 2023 Introduction Welcome to 6Valley. 6Valley (“us,” “we,” or “our”) operates at https:\/\/6valley.app (hereinafter referred to as “Service”). Our Privacy Policy regulates your visit to 6valley.app and describes how we collect, safeguard, and disclose data resulting from your use of our Service. We use your information to introduce and improve our &#8230; <a title=\"Privacy Policy\" class=\"read-more\" href=\"https:\/\/6valley.app\/privacy-policy\/\" aria-label=\"Read more about Privacy Policy\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"elementor_canvas","meta":{"footnotes":""},"class_list":["post-10558","page","type-page","status-publish"],"_links":{"self":[{"href":"https:\/\/6valley.app\/wp-json\/wp\/v2\/pages\/10558","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/6valley.app\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/6valley.app\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/6valley.app\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/6valley.app\/wp-json\/wp\/v2\/comments?post=10558"}],"version-history":[{"count":0,"href":"https:\/\/6valley.app\/wp-json\/wp\/v2\/pages\/10558\/revisions"}],"wp:attachment":[{"href":"https:\/\/6valley.app\/wp-json\/wp\/v2\/media?parent=10558"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}