{"id":14738,"date":"2023-07-26T11:21:38","date_gmt":"2023-07-26T11:21:38","guid":{"rendered":"https:\/\/demandium.app\/?page_id=14738"},"modified":"2024-04-01T08:35:32","modified_gmt":"2024-04-01T08:35:32","slug":"cookie-policy","status":"publish","type":"page","link":"https:\/\/demandium.app\/cookie-policy\/","title":{"rendered":"Cookies Policy for Demandium"},"content":{"rendered":"\n<h1 class=\"wp-block-heading\">Cookies Policy for Demandium<\/h1>\n\n\n\n<p>This is the Cookies Policy for Demandium, accessible from <a href=\"https:\/\/demandium.app\/\">https:\/\/demandium.app\/<\/a>&nbsp;&nbsp;&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Interpretation and Definitions<\/strong><\/h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Interpretation<\/strong><\/h3>\n\n\n\n<p>The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or plural.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Definitions<\/strong><\/h3>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>For the purposes of this Cookies Policy:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Company<\/strong> (referred to as either &#8220;the Company&#8221;, &#8220;We&#8221;, &#8220;Us&#8221;, or &#8220;Our&#8221; in this Cookies Policy) refers to 6amTech, Level: 02, House: 1005, 1007, Avenue: 11, Road: 09, Dhaka 1216, Bangladesh.<\/li>\n\n\n\n<li><strong>Cookies <\/strong>means small files that are placed on Your computer, mobile device or any other device by a website, containing details of your browsing history on that website among its many uses.<\/li>\n\n\n\n<li><strong>Website<\/strong> refers to Demandium, accessible from <a href=\"https:\/\/demandium.app\/\">https:\/\/demandium.app\/<\/a>&nbsp;&nbsp;&nbsp;&nbsp;<\/li>\n\n\n\n<li><strong>You<\/strong> mean the individual accessing or using the Website, a company, or any legal entity on behalf of which such individual is accessing or using the Website, as applicable.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What Are Cookies<\/strong><\/h3>\n\n\n\n<p>As is common practice with almost all professional websites, this site uses cookies, tiny files downloaded to your computer, to improve your experience. This page describes what information we gather, how we use it and why we sometimes need to store these cookies. We will also share how you can prevent these cookies from being stored; however, this may downgrade or &#8216;break&#8217; certain elements of the site&#8217;s functionality.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>The use of the Cookies<\/strong><\/h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Type of Cookies We Use<\/strong><\/h3>\n\n\n\n<p>Cookies can be &#8220;Persistent&#8221; or &#8220;Session&#8221; Cookies. Persistent Cookies remain on your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close your web browser.<\/p>\n\n\n\n<p>We use both session and persistent Cookies for the purposes set out below:<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Necessary \/ Essential Cookies<\/strong><\/h4>\n\n\n\n<p><strong>Type: <\/strong>Session Cookies<\/p>\n\n\n\n<p><strong>Administered by:<\/strong> Us<\/p>\n\n\n\n<p><strong>Purpose:<\/strong> These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts. Without these Cookies, the services that You have asked for cannot be provided, and We only use these Cookies to provide You with those services.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Functionality Cookies<\/strong><\/h4>\n\n\n\n<p><strong>Type:<\/strong> Persistent Cookies<\/p>\n\n\n\n<p><strong>Administered by:<\/strong> Us<\/p>\n\n\n\n<p><strong>Purpose:<\/strong> These Cookies allow us to remember choices You make when You use the Website, such as remembering your login details or language preference. The purpose of these Cookies is to provide You with a more personal experience and to avoid You having to re-enter your preferences every time You use the Website.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>How We Use Cookies<\/strong><\/h3>\n\n\n\n<p>We use cookies for a variety of reasons, detailed below.<\/p>\n\n\n\n<p>Unfortunately, in most cases, there are no industry standard options for disabling cookies without completely disabling the functionality and features they add to this site. It is recommended that you leave on all cookies if you are unsure whether you need them or not in case they are used to provide a service you use.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Your Choices Regarding Cookies<\/strong><\/h3>\n\n\n\n<p>If You prefer to avoid using Cookies on the Website, You must disable the Cookies in your browser and then delete the Cookies saved in your browser associated with this website. You may use this option to prevent using Cookies at any time.<\/p>\n\n\n\n<p>If You do not accept Our Cookies, You may experience some inconvenience in using the Website, and some features may not function properly.<\/p>\n\n\n\n<p>If You&#8217;d like to delete Cookies or instruct your web browser to delete or refuse Cookies, please visit the help pages of your web browser.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>For the Chrome web browser, please visit this page from Google: <\/strong><a href=\"https:\/\/support.google.com\/accounts\/answer\/32050\" target=\"_blank\" rel=\"noopener\">https:\/\/support.google.com\/accounts\/answer\/32050<\/a>&nbsp;<\/li>\n\n\n\n<li><strong>For the Internet Explorer web browser, please visit this page from Microsoft: <\/strong><a href=\"http:\/\/support.microsoft.com\/kb\/278835\" target=\"_blank\" rel=\"noopener\">http:\/\/support.microsoft.com\/kb\/278835<\/a>&nbsp;<\/li>\n\n\n\n<li><strong>For the Firefox web browser, please visit this page from Mozilla: <\/strong><a href=\"https:\/\/support.mozilla.org\/en-US\/kb\/delete-cookies-remove-info-websites-stored\" target=\"_blank\" rel=\"noopener\">https:\/\/support.mozilla.org\/en-US\/kb\/delete-cookies-remove-info-websites-stored<\/a>&nbsp;<\/li>\n\n\n\n<li><strong>For the Safari web browser, please visit this page from Apple: <\/strong><a href=\"https:\/\/support.apple.com\/guide\/safari\/manage-cookies-and-website-data-sfri11471\/mac\" target=\"_blank\" rel=\"noopener\">https:\/\/support.apple.com\/guide\/safari\/manage-cookies-and-website-data-sfri11471\/mac<\/a>&nbsp;<\/li>\n<\/ul>\n\n\n\n<p>For any other web browser, please visit your web browser&#8217;s official web pages.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Disabling Cookies<\/strong><\/h3>\n\n\n\n<p>You can prevent the setting of cookies by adjusting the settings on your browser. Be aware that disabling cookies will affect the functionality of this and many other websites that you visit. Disabling cookies will usually result in also disabling certain functionality and features of this site. Therefore it is recommended that you do not disable cookies.&nbsp;<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>The Cookies We Set:<\/strong><\/h4>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Account related cookies<\/strong><br>If you create an account with us, we will use cookies to manage the signup process and general administration. These cookies will usually be deleted when you log out; however, in some cases, they may remain afterwards to remember your site preferences when logged out.<\/li>\n\n\n\n<li><strong>Login related cookies<\/strong><br>We use cookies when you are logged in to remember this fact. This prevents you from having to log in every time you visit a new page. These cookies are typically removed or cleared when you log out to ensure that you can only access restricted features and areas when logged in.<\/li>\n\n\n\n<li><strong>Email newsletters-related cookies<\/strong><br>This site offers newsletter subscriptions, and cookies may be used to remember if you are already registered and whether to show certain notifications which might only be valid to subscribed\/unsubscribed users.<\/li>\n\n\n\n<li><strong>Orders processing related cookies<\/strong><br>This site offers e-commerce or payment facilities, and some cookies are essential to ensure that your order is remembered between pages so we can process it properly.<\/li>\n\n\n\n<li><strong>Surveys related cookies<\/strong><br>From time to time, we offer user surveys and questionnaires to provide you with interesting insights and helpful tools or to understand our user base more accurately. These surveys may use cookies to remember who has already taken part in a survey or provide accurate results after you change pages.<\/li>\n\n\n\n<li><strong>Forms related cookies<\/strong><br>When you submit data through a form such as those found on contact pages or comment forms, cookies may be set to remember your user details for future correspondence.<\/li>\n\n\n\n<li><strong>Site preferences cookies<\/strong><br>To provide you with a great experience on this site, we provide the functionality to set your preferences for how this site runs when you use it. To remember your preferences, we need to set cookies so that this information can be called whenever you interact with a page affected by your preferences.<\/li>\n<\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Third-Party Cookies<\/strong><\/h4>\n\n\n\n<p>In some special cases, we also use cookies provided by trusted third parties. The following section details which third-party cookies you might encounter through this site.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>This site uses Google Analytics, one of the most widespread and trusted analytics solutions on the web, to help us understand how you use the site and how we can improve your experience. These cookies may track how long you spend on the site and the pages you visit so we can continue producing engaging content.<br><\/li>\n\n\n\n<li>From time to time, we test new features and make subtle changes to how the site is delivered. When we are still testing new features, these cookies may be used to ensure that you receive a consistent experience whilst on the site whilst ensuring we understand which optimizations our users appreciate the most.<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>As we sell products, it&#8217;s important for us to understand statistics about how many of the visitors to our site actually make a purchase and as such, this is the kind of data that these cookies will track. This is important to you as it means we can accurately make business predictions to monitor our advertising and product costs to ensure the best possible price.<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>We also use social media buttons and\/or plugins on this site that allow you to connect with your social network in various ways. For these to work, the following social media sites, including; Facebook, Twitter, Linkedin, and YouTube, will set cookies through our site, which may be used to enhance your profile on their site or contribute to the data they hold for various purposes outlined in their respective privacy policies.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Contact Us<\/strong><\/h2>\n\n\n\n<p>If you have any questions about this Cookies Policy, You can contact us: <strong>By email:<\/strong><a href=\"mailto:support@6amtech.com\">support@6amtech.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Cookies Policy for Demandium This is the Cookies Policy for Demandium, accessible from https:\/\/demandium.app\/&nbsp;&nbsp;&nbsp;&nbsp; Interpretation and Definitions Interpretation The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or plural. Definitions For the purposes &#8230; <a title=\"Cookies Policy for Demandium\" class=\"read-more\" href=\"https:\/\/demandium.app\/cookie-policy\/\" aria-label=\"Read more about Cookies Policy for Demandium\">Read more<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"elementor_header_footer","meta":{"footnotes":""},"class_list":["post-14738","page","type-page","status-publish"],"_links":{"self":[{"href":"https:\/\/demandium.app\/wp-json\/wp\/v2\/pages\/14738","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/demandium.app\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/demandium.app\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/demandium.app\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/demandium.app\/wp-json\/wp\/v2\/comments?post=14738"}],"version-history":[{"count":0,"href":"https:\/\/demandium.app\/wp-json\/wp\/v2\/pages\/14738\/revisions"}],"wp:attachment":[{"href":"https:\/\/demandium.app\/wp-json\/wp\/v2\/media?parent=14738"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}